In [2]:
# import dependencies
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import requests

In [3]:
# read in manufacturing files
atlanta_manufacturing = "C:/Users/jessi/Documents/ProjectOne/Manufacturing Data/Atlanta.csv"
dallas_manufacturing = "C:/Users/jessi/Documents/ProjectOne/Manufacturing Data/Dallas.csv"
austin_manufacturing = "C:/Users/jessi/Documents/ProjectOne/Manufacturing Data/Austin.csv"
nashville_manufacturing = "C:/Users/jessi/Documents/ProjectOne/Manufacturing Data/Nashville.csv"

In [5]:
atlanta_manufacturing_df = pd.read_csv(atlanta_manufacturing)
atlanta_manufacturing_df.head()

   Year  Annual
0  1990   187.7
1  1991   179.6
2  1992   181.9
3  1993   185.3
4  1994   192.1

In [6]:
dallas_manufacturing_df = pd.read_csv(dallas_manufacturing)
dallas_manufacturing_df.head()

   Year  Annual
0  1990   343.0
1  1991   323.2
2  1992   310.1
3  1993   313.4
4  1994   318.4

In [7]:
austin_manufacturing_df = pd.read_csv(austin_manufacturing)
austin_manufacturing_df.head()

   Year  Annual
0  1990    47.7
1  1991    51.2
2  1992    54.3
3  1993    58.0
4  1994    61.7

In [8]:
nashville_manufacturing_df = pd.read_csv(nashville_manufacturing)
nashville_manufacturing_df.head()

   Year  Annual
0  1990    95.1
1  1991    95.0
2  1992    98.3
3  1993   103.2
4  1994   109.9